Tekla.Structures.Datatype.Settings
The Settings class contains the currently active unit settings.

Tekla.Structures.Datatype.Settings.GetValue(System.String)
Gets the value of the setting with the given name.
name: The name of the setting.
Returns: The value of the given setting.

Tekla.Structures.Datatype.Settings.TryGetValue(System.String,System.Object@)
Tries to get the value of the setting with the given name.
name: The name of the setting.
obj: The value of the given setting.
Returns: True on success, false otherwise.

Tekla.Structures.Datatype.Settings.TryGetValue``1(System.String,``0@)
Tries to get the value of the setting with the given name and given object type.
Type of the object to get
name: The name of the setting.
obj: The value of the given setting.
Returns: True on success, false otherwise.

Tekla.Structures.Datatype.Settings.SetValue(System.String,System.Object)
Sets a setting to a value.
name: The name of the setting.
value: The new value for the setting.